[
	{
		"firstName" : "Kael",
		"lastName" : "Milnick",
		"role" : "Crew Chief",
		"year" : 2026,
		"priority" : 0,
		"photo": "milnekKael.png",
		"email": "Km1694@princeton.edu",
		"summary" : "I'm from Lincoln Nebraska. I've been swimming since I was 9 years old and am on the Men's Swimming and Diving team. I am studying Computer Science with a minor in Religion. I love princeton, I wanted to come here since I was in 4th grade when my dad got me a Princeton shirt. I am also a member of Cannon Dial Elm. I can't wait to meet all of you and hopefully put on a great Reunions!!",
	},
	{
		"firstName" : "Lucas",
		"lastName" : "Tudoras",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "tudorasLucas.png",
		"email": "lucas.tudoras@princeton.edu",
		"summary" : "I’m an international student-athlete from Brazil studying computer science. I have a Romanian background as my entire family comes from Bucharest, but moved to Brazil before I was born. I lived my entire life in São Paulo before moving to the US to continue my academic and athletic career. Here at Princeton I take part in the Swimming and Diving varsity team and also in a student-venture called Watt-our, which aims to develop the software for end-to-end fully funded Virtual Power Plants (VPP). In simpler terms: we buy home batteries, install them at critical points in the grid, and then write the software that allows utilities to generate large savings [who, in exchange, pay Watt-Our].",
	},
	{
		"firstName" : "Meg",
		"lastName" : "Wheeler",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "wheelerMeg.png",
		"email": "mw3428@princeton.edu",
		"summary" : "I'm a junior from Ottawa, Canada, studying Psychology and Global Health Policy. I'm on the Women's Swim and Dive team, a member of University College Club, and a Peer Health Advisor on campus. Excited to celebrate an amazing 25th Reunions with everyone!",
	},
	{
		"firstName" : "Cooper",
		"lastName" : "Koers",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "koersCooper.png",
		"email": "ck5658@princeton.edu",
		"summary" : "I am a football player involved with the genomics lab on campus where I am in a few research labs. I am also a member of cottage.",
	},
	{
		"firstName" : "Catherine",
		"lastName" : "Ruiz",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "ruizCatherine.png",
		"email": "catherine.ruiz@princeton.edu",
		"summary" : "Welcome back to Princeton! My name is Catherine and I’m a junior studying Mechanical Engineering (MAE) from Nashua, NH. On campus I am the current Vice President of Más Flow Dance Company, an engineer for Princeton Racing Electric, the communications chair for Society of Hispanic Professional Engineers, and a member of the Aquinas Institute. I’m also a proud member of the Cap & Gown club and New College West residential college. I am so excited to meet all of you and help make your 25th Reunions the best time ever!",
	},
	{
		"firstName" : "Amparo",
		"lastName" : "Sanchez",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "as3346@princeton.edu",
		"summary" : "Sofia is currently a sophomore at Princeton University. She is originally from Roselle Park, NJ, and her parents are Colombian. Sofia is studying Psychology with a minor in Spanish. On campus, she is a part of Mas Flow (the Latin dance team), The Daily Princetonian, and the Princeton Baby Lab. Sofia hopes to pursue a career in a people-oriented field where she can combine her interests in consumer behavior and organizational optimization while making a positive social impact.",
	},
	{
		"firstName" : "Andrew",
		"lastName" : "Pedersen",
		"role" : "",
		"year" : 2028,
		"priority" : 1,
		"photo": "",
		"email": "ap3795@princeton.edu",
		"summary" : "I am a SPIA major who loves politics, economics, and history. I am on the football team and I play offensive line. I love to play table tennis and I want to live in NYC after college. I am from Nashville, Tennessee. When I become older I want to start a non profit for single moms in the United States.",
	},
	{
		"firstName" : "Barrett",
		"lastName" : "Eddlemon",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "be5377@princeton.edu",
		"summary" : "My name is Barrett Eddlemon and I am a sophomore politics major here at princeton. Outside of school I’m also a member of the varsity football team, I really enjoy all things outdoors and have a slowly improving golf game that might stress me out more than princeton itself. I’m really excited to meet and serve all of the great alumni and look forward to meeting everyone!",
	},
	{
		"firstName" : "Benjamin",
		"lastName" : "Romig",
		"role" : "",
		"year" : 2028,
		"priority" : 1,
		"photo": "",
		"email": "br6140@princeton.edu",
		"summary" : "I'm a diver on the Men's Swimming and diving team. My potential majors are Economics or Mathematics. I'm from Texas.",
	},
	{
		"firstName" : "Blaine",
		"lastName" : "Hipa",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "bh2398@princeton.edu",
		"summary" : "From Hawaii,  quarterback on the football team",
	},
	{
		"firstName" : "Connor",
		"lastName" : "Odom",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "wo9078@princeton.edu",
		"summary" : "Connor Odom ‘27 is a transfer student with over 10 years of filmmaking and videography experience. On campus, he’s the Co-Founder and President of Princeton Pictures, an student-run film production company, the Social Chair of the Princeton Footnotes, and a proud member of the glorious Tiger Inn. ",
	},
	{
		"firstName" : "Conor",
		"lastName" : "McKenna",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "cm5238@princeton.edu",
		"summary" : "Hey! I'm Conor McKenna, and I'm from Frisco, Texas. I'm a junior swimmer for the varsity men's swimming and diving team studying computer science and pursuing minors in environmental studies and religion. I'm also involved with a few clubs on campus, including the energy association, real estate club, Varsity Student-Athlete Advisory Committee, and Cannon Dial Elm Club. I absolutely love Princeton, and am excited to share this pride for the best old place of all at Reunions this year with everyone on campus! I can't wait to meet y'all!",
	},
	{
		"firstName" : "Dakota",
		"lastName" : "Tucker",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "dt5137@princeton.edu",
		"summary" : "I am a Sophmore from Johannesburg, South Africa, on the Princeton Women’s swim team and I am majoring in mechanical engineering.",
	},
	{
		"firstName" : "Daniel",
		"lastName" : "Kim",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "danielkim@princeton.edu",
		"summary" : "Econ Major<br>From NJ<br>On the Swim Team<br>Ivy Club",
	},
	{
		"firstName" : "Devyn",
		"lastName" : "Caples",
		"role" : "",
		"year" : 2028,
		"priority" : 1,
		"photo": "",
		"email": "dc3944@princeton.edu",
		"summary" : "I'm Devyn Caples, born and raised from the Bay Area, CA. I’m also a student athlete, swimming for Princeton, and a prospective Mechanical Engineering major. As this is my first Reunions I’m attending, I cannot wait to meet alumni and watch the P-rade!  Can’t wait to meet everyone and I’d love to hear all the stories y’all have. ",
	},
	{
		"firstName" : "Eliza",
		"lastName" : "Brown",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "eb2120@princeton.edu",
		"summary" : "Hi! My name is Eliza Brown, and I am from Boston, Massachusetts. At Princeton, I am a rising senior on the Women’s Swimming and Diving Team. Aside from athletics, I am a member of Princeton Rocketry club and in Cannon Dial Elm Club. ",
	},
	{
		"firstName" : "Grace",
		"lastName" : "Black",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "gb3477@princeton.edu",
		"summary" : "I’m a sophomore on the Princeton Women’s Swimming and Diving. I am involved in Best Buddies Program and Tiger Pals. I am a member of Pi Beta Phi and Princeton Women in Economics & Policy. My favorite color is blue. I'm looking forward to making connections with the alumni and contributing to such a special event",
	},
	{
		"firstName" : "Joey",
		"lastName" : "Wassler",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "jw0751@princeton.edu",
		"summary" : "I am from Cincinnati, Ohio and I have 5 siblings, 4 brothers and one sister. Also, I have been involved in a couple of different things here on campus, including the football team and being a tour guide all of last summer. SPIA is the major that has sparked my interest and I think I am going to go down that road. Lastly, I like to go to my favorite sports teams games, the Reds and Bengals, I enjoy biking and swimming, and I'm getting a minor in Spanish because I want to become as close to being fluent as I possibly can.",
	},
	{
		"firstName" : "Julia",
		"lastName" : "Stern",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "js5701@princeton.edu",
		"summary" : "Hi! My name is Julia, and I'm a junior in the History Department from Pittsburgh, PA. On campus, I'm an editor for the Nassau Weekly, a leader with Outdoor Action, and a baker at Murray Dodge. My favorite thing to do is write, and my least favorite thing to do is .... also write. Looking forward to helping make your 25th Reunion an unforgettable experience!",
	},
	{
		"firstName" : "Margaret",
		"lastName" : "Hayes",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "mh6247@princeton.edu",
		"summary" : "Hi! My name is Margaret Hayes and I’m from Bainbridge Island, Washington. I’m currently a junior in the SPIA department and also pursuing an urban studies certificate. I’m on the women’s varsity swim team and I’m also a member of cannon dial elm. I really enjoyed being a part of Princeton Reunions last year and I can’t wait to meet all of you!",
	},
	{
		"firstName" : "Maxwell",
		"lastName" : "Marcus",
		"role" : "",
		"year" : 2028,
		"priority" : 1,
		"photo": "",
		"email": "mm1568@princeton.edu",
		"summary" : "I’m from St. Louis, MO; Member of PUCSDT; I’m looking forward to meeting interesting Alumni and the fireworks; Favorite color is green; cut; Math major; I’m interested in VC and entrepreneurship",
	},
	{
		"firstName" : "Misa",
		"lastName" : "Mims",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "mm6233@princeton.edu",
		"summary" : "My name is Misa Mims and I am a sophomore from Atlanta, Georgia. I am a SPIA major and Spanish minor. I have strong interests in consulting, finance, and diplomacy. On campus I am involved in the USG Social Committee, Service Focus, and I work at the Makerspace! I am the vp of recruitment for Kappa Alpha Theta sorority and recently joined Ivy club. I am looking forward to another wonderful reunion!!",
	},
	{
		"firstName" : "Nicki",
		"lastName" : "Gaito",
		"role" : "",
		"year" : 2028,
		"priority" : 1,
		"photo": "",
		"email": "ng7742@princeton.edu",
		"summary" : "Hello, I’m Nicki Gaito! I’m a freshman from San Francisco and a member of the Princeton Women’s Volleyball team. I am a prospective SPIA major interested in gender policy and global development (I’m headed to Ireland this summer for a global seminar about these issues!) Outside of academics and athletics, I enjoy traveling and baking. I’m super excited to be part of the 25th Reunions crew and can’t wait to celebrate this summer!  ",
	},
	{
		"firstName" : "Rachel",
		"lastName" : "Bejo",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "mb5785@princeton.edu",
		"summary" : "I am a junior from Maryland. I'm majoring in economics and pursuing a minor in French. I have been a coxswain on the women’s lightweight crew team for the past two years, work at the McGraw Center, been engaged with the Pace Center, and enjoy pursuing film in my free time! ",
	},
	{
		"firstName" : "Ryan",
		"lastName" : "Hunstein",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "rh7277@princeton.edu",
		"summary" : " I am a rising senior studying mechanical engineering. At Princeton, I am a Peer Academic Advisor in Rocky College and tutor high school students in various subjects. For fun, I write crosswords for the Daily Princetonian, I am captain of the Wawa United soccer club, and I am a member of the Tiger Inn. I am also an Eagle Scout with a passion for the outdoors, a love for film, and a strong interest in music. ",
	},
	{
		"firstName" : "Sabrina",
		"lastName" : "Johnston",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "sj6891@priceton.edu",
		"summary" : "Member of Women’s Swim and Dive, Photographer for BodyHype, Peer Health Advisor, from Westchester New York, love to draw, take pictures or do any type of arts and crafts, and have a dog named Kipp!",
	},
	{
		"firstName" : "Sekou",
		"lastName" : "Roland",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "sekou@princeton.edu",
		"summary" : "Cottage, football, Philadelphia, E-club, blockchain club, esports club, excited to see my seniors friends one last time before they go out into the world beyond Princeton and celebrate them in the most Princeton way possible. ",
	},
	{
		"firstName" : "Veronique",
		"lastName" : "Rossouw",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "vr1068@princeton.edu",
		"summary" : "My name is Veronique, but I go by Niqi. I was born in the UK, but I’ve lived in South Africa for most of my life. I am part of the varsity women’s swim and dive team, and I’m proud to say that we have won the Ivy championships for three consecutive years in a row. I am part of the 2025 NCAA division I team that will take part at NCAA’s in March. I’m part of Princeton’s Varsity Club TigerPals program which involves being a mentor and role model for young kids in the community. I’m studying Chemical and Biological Engineering with a minor in Neuroscience and I look forward to hearing all the amazing stories from alumni during reunions -about their time at Princeton and what Princeton meant to them. I love hearing how people experienced Princeton different from my own experience, because I believe it grows my own perspective of the University and what it has to offer.",
	},
	{
		"firstName" : "Yuka",
		"lastName" : "Childers",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "yc7637@princeton.edu",
		"summary" : "Hi, I’m Yuka, a third year student majoring in Psychology from Hickory, North Carolina. Alongside my studies, I work part-time at Campus Rec and I am involved in the Princeton mixed students association, the USG mental health committee, the SHARE Peer program, and I work as a counselor for the Princeton chapter of Camp Kesem. I am grateful for this opportunity and I am looking forward to meeting Alumni and working with my peers to contribute to the success of reunions!",
	},
	{
		"firstName" : "Philip",
		"lastName" : "Eichelzer",
		"role" : "",
		"year" : 2027,
		"priority" : 1,
		"photo": "",
		"email": "pe7601@princeton.edu",
		"summary" : "Hi, I'm a Sophmore from Georgia majoring in Ecology and Evolutionary Biology. I play Center for the Football team here at Princeton. I worked the 50th reunion last year and had a great time. I'm looking forawrd to helping out!",
	},
	{
		"firstName" : "Sullivan",
		"lastName" : "Atkin",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "sa2741@princeton.edu",
		"summary" : "I’m a Junior from Arlington, VA studying Economics and minoring in History. I’m a goalkeeper on the Men’s Soccer team and a member of Cottage. I’m also involved with Princeton Corporate Finance Club and Tiger Sustainable Investment Group. I’m really looking forward to meeting a ton of alumni and learning more about them and their time at Princeton!",
	},
	{
		"firstName" : "Charlotte",
		"lastName" : "Martinkus",
		"role" : "",
		"year" : 2026,
		"priority" : 1,
		"photo": "",
		"email": "cm5629@princeton.edu",
		"summary" : "I’m a junior from Weston, MA. I am a diver on the Women’s Swim and Dive Team and I am studying SPIA with a minor in Spanish. I am also a member of the University Cottage Club, a member of VSAAC and I work at Tiger call! I am so excited to work reunions this year ",
	}
]
