[
	{
		"firstName" : "Carla",
		"lastName" : "Berube",
		"title": "Ms.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "berube.png",
		"email": "cberube@princeton.edu",
		"summary" : "In her first five seasons as the head coach of the Princeton Women’s Basketball Team, Carla amassed an .855 winning percentage and a 44-2 record in conference play. Her teams have brought Princeton renown on the national stage, with their runs in the NCAA tournament in 2022 and 2023 electrifying our alumni community. A member of the Connecticut Women’s Basketball Hall of Fame, and the New England Basketball Hall of Fame, her commitment to her players is unparalleled and her leadership is an example to us all.",
	},
	{
		"firstName" : "Alan",
		"lastName" : "Blinder",
		"title": "Prof.",
		"role" : "",
		"year" : 1967,
		"priority" : 0,
		"photo": "blinder.png",
		"email": "blinder@princeton.edu",
		"summary" : "",
	},
	{
		"firstName" : "Ted",
		"lastName" : "Borer",
		"title": "Mr.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "borer.png",
		"email": "etborer@princeton.edu",
		"summary" : "In recognition of his remarkable contributions over 30 years as the Energy Plant Director at Princeton University. Throughout his tenure, Borer played a pivotal role in advancing Princeton’s energy systems, including the transition to geo-exchange facilities aimed at driving Princeton to carbon neutrality. His engaging way of sharing knowledge, including giving lectures, advising student projects, and providing insights to national audiences, has left a lasting impact on the university community.",
	},
	{
		"firstName" : "Rochelle",
		"lastName" : "Calhoun",
		"title": "Ms.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "calhoun.png",
		"email": "rochelle.calhoun@princeton.edu",
		"summary" : "Since joining Princeton in 2015, Rochelle has been an incredible advocate for students and has transformed the Princeton campus – the Meadows Campus, the Frist Health Center, and the Class of 1986 Fitness and Wellness Center among the most visible and immediate examples. She has also worked to change the fabric of the institution, leading efforts to make Princeton both healthier and more welcoming to tigers of all stripes.",
	},
	{
		"firstName" : "Tom",
		"lastName" : "Dunne",
		"title": "Mr.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "dunne.png",
		"email": "thos.dunne@gmail.com",
		"summary" : "",
	},
	{
		"firstName" : "Lisa P.",
		"lastName" : "Jackson",
		"title": "Ms.",
		"role" : "",
		"year" : 1986,
		"priority" : 0,
		"photo": "jackson.png",
		"email": "lisa_jackson@apple.com",
		"summary" : "In recognition of her significant contributions to public service and environmental policy. After graduating from Princeton with a M.S.E. in chemical engineering in 1986, Lisa joined the EPA as a staff engineer. In 2002, she returned to New Jersey, joining the Department of Environmental Protection in 2002 and becoming the state commissioner of Environmental Protection in 2006. In 2008, Jackson was named administrator of the U.S. Environmental Protection Agency and took action to implement stringent environmental regulations and champion sustainable practices. Since joining Apple in 2013, she has shown a path forward for all companies to minimize their impact on our climate through both efficiency and innovation. Her deep commitment to protecting the environment and urgent leadership in combating climate change are an inspiration in service of humanity.",
	},
	{
		"firstName" : "Mark",
		"lastName" : "Milley",
		"title": "Gen.",
		"role" : "",
		"year" : 1980,
		"priority" : 0,
		"photo": "",
		"email": "mhmpmilley@aol.com",
		"summary" : "In recognition of his exemplary leadership and service to the nation. A distinguished military officer, Milley's commitment to national security and his unwavering dedication to the principles of democracy embody the values that Princeton seeks to instill in its graduates. His contributions to international military strategy and crisis management, particularly during challenging global events, resonate with the spirit of service and excellence that define the Princeton community.",
	},
	{
		"firstName" : "Sue",
		"lastName" : "Pierson",
		"title": "Ms.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "",
		"email": "suepierson55@gmail.com",
		"summary" : "Sue became the university dietician in 1987 and found a home in the University community. Sue spent over three decades working with over 50,000 students and countless alumni. A recipient of the Alumni Council Award for Service, Sue is an honorary member of seven classes and sees Princeton as her home and alumni and students as her family. We agree.",
	},
	{
		"firstName" : "Robert",
		"lastName" : "Socolow",
		"title": "Dr.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "",
		"email": "socolow@princeton.edu",
		"summary" : "",
	},
	{
		"firstName" : "Mibs",
		"lastName" : "Southerland",
		"title": "Ms.",
		"role" : "",
		"year" : 2000,
		"priority" : 0,
		"photo": "",
		"email": "milbrey@princeton.edu",
		"summary" : "As a toddler, Mibs marched in the P-Rade with the Class of 1926 for their 40th Reunion. She has kept the Reunions fire burning bright in the ensuing years, known across the Princeton community as the Soul of Reunions. Whenever a class is not sure where to go or what to do next, Mibs is there with grace and guidance. For a class that both reaches back and brings forward Princeton’s best traditions, we would be incomplete without Mibs.",
	},
	{
		"firstName" : "Sean",
		"lastName" : "Wilentz",
		"title": "Prof.",
		"role" : "",
		"year" : 0,
		"priority" : 0,
		"photo": "",
		"email": "swilentz@princeton.edu",
		"summary" : "",
	},
]
